Revit 2027 API
ExternalResourceTypes.BuiltInExternalResourceTypes.DecalImage Property
 An external resource type representing decal images.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalResourceType DecalImage { get; }
Public Shared ReadOnly Property DecalImage As ExternalResourceType
	Get
public:
static property ExternalResourceType^ DecalImage {
	ExternalResourceType^ get ();
}
static member DecalImage : ExternalResourceType with get
Property Value
ExternalResourceType
See Also
Reference
ExternalResourceTypes.BuiltInExternalResourceTypes Class
Autodesk.Revit.DB Namespace